ОперативныеЗадачиЗанятие4/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиЗанятие4/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>МетодСписанияСебестоимости</name>
    <type>
      <types>EnumRef.МетодыСписанияСебестоимости</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ОперативныеЗадачиЗанятие4/src/AccumulationRegisters/СебестоимостьТоваров/СебестоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СебестоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиЗанятие4/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Свободно</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <attributes>
    <name>ОтветственныйЗаЗакупки</name>
    <type>
      <types>CatalogRef.Менеджеры</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиЗанятие4/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиЗанятие4/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиЗанятие4/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиЗанятие4/src/Enums/МетодыСписанияСебестоимости/МетодыСписанияСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыСписанияСебестоимости</name>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
  <enumValues>
    <name>ЛИФО</name>
  </enumValues>
</mdclass:Enum>

ОперативныеЗадачиЗанятие4/src/Documents/ПоступлениеТоваровИУслуг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеТовары.Номенклатура,
	|	ПоступлениеТовары.Количество,
	|	ПоступлениеТовары.Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТовары
	|ГДЕ
	|	ПоступлениеТовары.Ссылка = &Ссылка
	|	И ПоступлениеТовары.Номенклатура.Услуга = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.МетодСписанияСебестоимости КАК МетодСписанияСебестоимости
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика.СрезПоследних(&Период,) КАК УчетнаяПолитикаСрезПоследних";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапроса = МассивРезультатовЗапроса.Получить(1);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	МетодСписанияСебестоимости = ВыборкаДетальныеЗаписи.МетодСписанияСебестоимости;

	РезультатЗапроса = МассивРезультатовЗапроса.Получить(0);

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.СебестоимостьТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		
		Если МетодСписанияСебестоимости = Перечисления.МетодыСписанияСебестоимости.ФИФО Тогда
			Движение.Партия = Ссылка;
		КонецЕсли;
		
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;

		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		Движение.ОтветственныйЗаЗакупки = Ответственный;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;

	КонецЦикла;

	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Товары.Итог("Сумма");
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТовары.Ссылка.Заказ,
	               |	ПоступлениеТовары.Номенклатура,
	               |	ПоступлениеТовары.Количество,
	               |	ПоступлениеТовары.Сумма
	               |ИЗ
	               |	Документ.ПоступлениеТоваровИУслуг.Товары КАК ПоступлениеТовары
	               |ГДЕ
	               |	ПоступлениеТовары.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.ЗаказыПоставщикам.Добавить();

		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;

		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.ЗаказПоставщику = ВыборкаДетальныеЗаписи.Заказ;

		Движение.Количество = ВыборкаДетальныеЗаписи.Количество;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;

	КонецЦикла;
	

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.СвободныеОстатки.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Движения.СебестоимостьТоваров.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.ЗаказыПоставщикам.Записывать = Истина;
	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда

		Если ДанныеЗаполнения.Проведен = Ложь Тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент КАК Контрагент,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад КАК Склад,
		|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Ответственный КАК Ответственный,
		|	ЗаказыПоставщикамОстатки.Номенклатура,
		|	ЗаказыПоставщикамОстатки.КоличествоОстаток КАК Количество,
		|	ЗаказыПоставщикамОстатки.СуммаОстаток КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЗаказыПоставщикамОстатки.КоличествоОстаток = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказыПоставщикамОстатки.СуммаОстаток / ЗаказыПоставщикамОстатки.КоличествоОстаток
		|	КОНЕЦ КАК Цена
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(, ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстатки";

		Запрос.УстановитьПараметр("ЗаказПоставщику", ДанныеЗаполнения);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;

		КонецЦикла;

		//Данные в переменной ВыборкаДетальныеЗаписи Не очищаются!!
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		Склад = ВыборкаДетальныеЗаписи.Склад;
		Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
		Заказ = ДанныеЗаполнения;

	КонецЕсли;

КонецПроцедуры
